[
  {
    "id": 1,
    "name": "Samsung Galaxy S23 Ultra",
    "type": "Smartphone Device",
    "description": "The Samsung Galaxy S23 Ultra is a powerhouse of innovation, blending stunning design with top-notch performance. Its vibrant display and powerful processor ensure seamless multitasking and gaming. With an advanced camera system, it captures every moment with precision. Packed with features like enhanced security and intuitive UI, it offers an unmatched mobile experience. Discover limitless possibilities with the S23 Ultra.",
    "price": 1188,
    "image": "/static/img/phone/device/samsung-galaxy-s23-ultra.jpg",
    "CPU": "Exynos 2200 (or Snapdragon 8 Gen 1)",
    "RAM": "8GB",
    "storage_capacity": "256GB",
    "battery_power_time": "Up to 17 hours (video playback)",
    "screen_type": "AMOLED",
    "resolution": "1440 x 3088",
    "camera": "Quad-lens camera system",
    "connectivity": "USB-C,Wi-Fi 6E,Bluetooth 5.2",
    "operating_system": "Android",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 2,
    "name": "Sony WH-1000XM5",
    "type": "Audio",
    "description": "The Sony WH-1000XM5 sets the standard for premium audio quality. With cutting-edge noise-cancelling technology, it immerses you in pure sound. Its ergonomic design ensures comfort during extended wear. Offering seamless connectivity and intuitive controls, it enhances your audio experience on the go. Whether you're commuting or relaxing, the WH-1000XM5 delivers unparalleled sound performance, making it a must-have for audiophiles and music enthusiasts alike.",
    "price": 400,
    "image": "/static/img/audio/sony-wh-1000xm5.jpg",
    "battery_power_time": "Up to 40 hours (with noise cancellation)",
    "connectivity": "Bluetooth 5.2",
    "brand": "Sony",
    "sales": 0
  },
  {
    "id": 3,
    "name": "Apple MacBook Air M2",
    "type": "Computer Laptop",
    "description": "The Apple MacBook Air M2 combines sleek design with powerful performance. With the latest M2 chip, it's lightning-fast and efficient. The stunning Retina display brings your content to life, while features like Touch ID ensure security and convenience. Perfect for work or play, it redefines the laptop experience.",
    "price": 1299,
    "image": "/static/img/computer/laptop/macbook-air-m2.jpg",
    "CPU": "Apple M2",
    "RAM": "8GB",
    "storage_capacity": "256GB",
    "screen_type": "Retina",
    "resolution": "13.6\" (2534 x 1664)",
    "connectivity": "2x Thunderbolt 4 ports,USB-A port,MagSafe 3 port",
    "operating_system": "macOS",
    "brand": "Apple",
    "sales": 0
  },
  {
    "id": 4,
    "name": "Fitbit Sense 2",
    "type": "Smartwatch",
    "description": "The Fitbit Sense 2 is a next-generation smartwatch designed to enhance your overall well-being. Building upon its predecessor, it offers advanced health monitoring features, including heart rate tracking, sleep analysis, and stress management tools. With its sleek design and comprehensive fitness tracking capabilities, it's your ultimate companion for staying active and maintaining a healthy lifestyle.",
    "price": 329,
    "image": "/static/img/smartwatch/fitbit-sense-2.jpg",
    "battery_power_time": "Up to 6 days",
    "connectivity": "Bluetooth",
    "brand": "Fitbit",
    "sales": 0
  },
  {
    "id": 5,
    "name": "Sony A7 IV",
    "type": "Camera",
    "description": "The Sony A7 IV is a cutting-edge camera renowned for its exceptional imaging capabilities. As the latest addition to the renowned A7 series, it combines high-resolution imaging with advanced video performance, making it ideal for both professional photographers and videographers. With its versatility, robust features, and superb image quality, the A7 IV sets a new standard in the world of mirrorless cameras.",
    "price": 2498,
    "image": "/static/img/camera/sony-a7-iv.jpg",
    "sensor": "Full-frame",
    "megapixels": "33MP",
    "brand": "Sony",
    "sales": 0
  },
  {
    "id": 6,
    "name": "Samsung Galaxy Watch 5",
    "type": "Smartwatch",
    "description": "The Samsung Galaxy Watch 5 is a top-tier smartwatch that seamlessly blends style and functionality. Boasting a stunning design and a host of innovative features, it's the perfect companion for your active lifestyle. With advanced health tracking sensors, intuitive fitness monitoring, and convenient connectivity options, the Galaxy Watch 5 keeps you in tune with your health and connected to what matters most, all from your wrist.",
    "price": 309,
    "image": "/static/img/smartwatch/samsung-galaxy-watch-5.jpg",
    "battery_power_time": "Up to 5 days",
    "connectivity": "Bluetooth",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 7,
    "name": "Google Nest Hub (2nd Gen)",
    "type": "Audio",
    "description": "The Google Nest Hub (2nd Gen) is a smart audio device with a vibrant touchscreen and built-in Google Assistant. It's your personal assistant, managing your day, controlling smart home devices, and delivering information with ease.",
    "price": 99,
    "image": "/static/img/audio/google-nest-hub.jpg",
    "display_size": "7 inches",
    "connectivity": "Wi-Fi",
    "brand": "Google",
    "sales": 0
  },
  {
    "id": 8,
    "name": "DJI Osmo Action 3",
    "type": "Camera",
    "description": "The DJI Osmo Action 3 is a next-generation camera designed for adventure enthusiasts. With its rugged build and advanced features, it's built to withstand extreme conditions while delivering stunning footage. Whether you're capturing fast-paced action or scenic landscapes, the Osmo Action 3 ensures crisp, stable shots, making it the perfect companion for all your outdoor adventures.",
    "price": 329,
    "image": "/static/img/camera/dji-osmo-action-3.jpg",
    "battery_power_time": "Up to 145 minutes (4K/30fps)",
    "resolution": "4K",
    "connectivity": "USB-C",
    "brand": "DJI",
    "sales": 0
  },
  {
    "id": 9,
    "name": "Sony PlayStation 5",
    "type": "Gaming",
    "description": "The Sony PlayStation 5 is the pinnacle of gaming consoles, offering unparalleled power and performance. With cutting-edge hardware, lightning-fast load times, and immersive 3D audio, it delivers a gaming experience like no other. Whether you're diving into epic adventures, competing in multiplayer battles, or exploring innovative new titles, the PS5 sets the standard for next-generation gaming.",
    "price": 499,
    "image": "/static/img/gaming/sony-playstation-5.jpg",
    "storage_capacity": "825GB",
    "connectivity": "HDMI,USB-A,USB-C",
    "brand": "Sony",
    "sales": 0
  },
  {
    "id": 10,
    "name": "Apple AirPods Pro",
    "type": "Audio",
    "description": "The Apple AirPods Pro redefine your audio experience with their immersive sound quality and customizable fit. Featuring active noise cancellation and transparency mode, they adapt to your environment, keeping you focused or aware as needed. With seamless integration with Apple devices and intuitive touch controls, the AirPods Pro deliver convenience and premium audio wherever you go.",
    "price": 249,
    "image": "/static/img/audio/apple-airpods-pro.jpg",
    "battery_power_time": "Up to 4.5 hours",
    "connectivity": "Bluetooth",
    "brand": "Apple",
    "sales": 0
  },
  {
    "id": 11,
    "name": "Samsung Galaxy Tab S8 Ultra",
    "type": "Computer Tablet",
    "description": "\nThe Samsung Galaxy Tab S8 Ultra is a powerhouse in the world of tablet computing. With its stunning display, powerful processor, and versatile S Pen compatibility, it offers a premium experience for both work and play. Whether you're streaming content, sketching ideas, or tackling productivity tasks, the Tab S8 Ultra provides the performance and versatility you need to stay productive and entertained on the go.",
    "price": 1188,
    "image": "/static/img/computer/tablet/samsung-galaxy-tab-s8-ultra.jpg",
    "CPU": "Snapdragon 8 Gen 1",
    "RAM": "12GB",
    "storage_capacity": "256GB",
    "battery_power_time": "Up to 14 hours (video playback)",
    "resolution": "14.6\" (2960 x 1848)",
    "connectivity": "USB-C",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 12,
    "name": "GoPro HERO10 Black",
    "type": "Camera",
    "description": "The GoPro HERO10 Black is the ultimate action camera, built to capture every adventure with stunning detail and clarity. Featuring advanced stabilization technology and high-quality video capabilities, it ensures smooth footage even in the most extreme conditions. With its rugged design and intuitive controls, the HERO10 Black is the perfect companion for adrenaline junkies and outdoor enthusiasts alike, ready to document every thrilling moment.",
    "price": 429,
    "image": "/static/img/camera/gopro-hero10-black.jpg",
    "resolution": "5.3K",
    "battery_power_time": "Up to 70 minutes (5.3K/30fps)",
    "connectivity": "USB-C",
    "brand": "GoPro",
    "sales": 0
  },
  {
    "id": 13,
    "name": "Nintendo Switch OLED",
    "type": "Gaming",
    "description": "The Nintendo Switch OLED offers an enhanced gaming experience with its vibrant OLED display and versatile play modes. Whether you're gaming on the go or enjoying multiplayer fun at home, its innovative design and extensive game library provide endless entertainment for players of all ages. With the flexibility to switch between handheld, tabletop, and docked modes, the Nintendo Switch OLED delivers immersive gaming experiences anytime, anywhere.",
    "price": 349,
    "image": "/static/img/gaming/nintendo-switch-oled.jpg",
    "storage_capacity": "64GB",
    "connectivity": "HDMI,USB-C",
    "brand": "Nintendo",
    "sales": 0
  },
  {
    "id": 14,
    "name": "Nest Wifi Pro",
    "type": "Computer Network",
    "description": "The Nest Wifi Pro is a cutting-edge computer network solution designed to provide fast and reliable internet connectivity throughout your home or office. With its mesh network technology and advanced features, it ensures seamless coverage and high-speed internet access for all your devices. Whether you're streaming, gaming, or video conferencing, the Nest Wifi Pro delivers a stable connection and optimal performance, keeping you connected and productive.",
    "price": 399,
    "image": "/static/img/computer/network/nest-wifi-pro.jpg",
    "brand": "Google",
    "sales": 0
  },
  {
    "id": 15,
    "name": "Meta Quest 2",
    "type": "Gaming",
    "description": "The Meta Quest 2 is a groundbreaking virtual reality headset that transports you to immersive gaming worlds with its advanced technology and intuitive design. Offering a wide range of games and experiences, it provides endless entertainment and exploration opportunities for gamers of all ages. With its wireless freedom and high-resolution display, the Quest 2 delivers unparalleled VR experiences, making it a must-have for anyone seeking to unlock new dimensions of gaming excitement.",
    "price": 399,
    "image": "/static/img/gaming/meta-quest-2.jpg",
    "connectivity": "Wi-Fi",
    "brand": "Meta",
    "sales": 0
  },
  {
    "id": 16,
    "name": "Garmin Forerunner 255 Music",
    "type": "Smartwatch",
    "description": "The Garmin Forerunner 255 Music is a fitness-focused smartwatch with GPS, heart rate monitoring, and music playback. It's designed to optimize workouts and keep you motivated with your favorite tunes, making it perfect for active lifestyles.",
    "price": 399,
    "image": "/static/img/smartwatch/garmin-forerunner-255-music.jpg",
    "battery_power_time": "Up to 14 days",
    "storage_capacity": "16GB",
    "connectivity": "Bluetooth",
    "brand": "Garmin",
    "sales": 0
  },
  {
    "id": 17,
    "name": "Apple iPad mini (6th Gen)",
    "type": "Computer Tablet",
    "description": "The Apple iPad mini (6th Gen) is a compact yet powerful computer tablet that offers portability without compromising performance. With its vibrant display, powerful A-series chip, and support for the Apple Pencil, it's perfect for both productivity and entertainment on the go. Whether you're browsing the web, creating content, or enjoying your favorite apps, the iPad mini (6th Gen) delivers a premium tablet experience in a sleek and portable package.",
    "price": 499,
    "image": "/static/img/computer/tablet/apple-ipad-mini.jpg",
    "CPU": "Apple A15 Bionic",
    "RAM": "4GB",
    "storage_capacity": "64GB",
    "battery_power_time": "Up to 10 hours (Wi-Fi browsing)",
    "resolution": "8.3\" (1488 x 2532)",
    "connectivity": "USB-C",
    "brand": "Apple",
    "sales": 0
  },
  {
    "id": 18,
    "name": "Google Pixelbook Go",
    "type": "Computer Laptop",
    "description": "The Google Pixelbook Go is a stylish and lightweight laptop designed for both work and play. With its sleek design and long battery life, it's perfect for staying productive on the move. Powered by Chrome OS, it offers seamless access to Google's ecosystem, ensuring a smooth and efficient user experience for all your computing needs.",
    "price": 349,
    "image": "/static/img/computer/laptop/google-pixelbook-go.jpg",
    "RAM": "8GB",
    "storage_capacity": "128GB",
    "battery_power_time": "Up to 12 hours",
    "connectivity": "USB-C",
    "operating_system": "Chrome OS",
    "brand": "Google",
    "sales": 0
  },
  {
    "id": 19,
    "name": "Belkin BoostCharge Pro 3-in-1 Wireless Charging Pad",
    "type": "Smartphone Chargers",
    "description": "The Belkin BoostCharge Pro 3-in-1 Wireless Charging Pad is a versatile charging solution designed to power up your devices efficiently. With the capability to simultaneously charge your smartphone, AirPods, and Apple Watch wirelessly, it simplifies your charging routine and reduces cable clutter. Its sleek design and reliable performance make it an essential accessory for keeping your devices powered throughout the day.",
    "price": 99,
    "image": "/static/img/phone/chargers/belkin-boostcharge-pro-3-in-1-wireless-charging-pad.jpg",
    "brand": "Belkin",
    "sales": 0
  },
  {
    "id": 20,
    "name": "JBL Flip 6 Portable Bluetooth Speaker",
    "type": "Audio",
    "description": "The JBL Flip 6 Portable Bluetooth Speaker offers powerful sound in a compact design, perfect for on-the-go listening. With Bluetooth connectivity and a durable build, it's ideal for outdoor adventures and gatherings.",
    "price": 129,
    "image": "/static/img/audio/jbl-flip-6-portable-bluetooth-speaker.jpg",
    "battery_power_time": "Up to 24 hours",
    "connectivity": "Bluetooth",
    "brand": "JBL",
    "sales": 0
  },
  {
    "id": 21,
    "name": "Samsung Galaxy Book 2 Pro 360",
    "type": "Computer Laptop",
    "description": "The Samsung Galaxy Book 2 Pro 360 is a versatile laptop that combines sleek design with powerful performance. With its 360-degree hinge and touchscreen display, it offers flexibility for work and entertainment. Featuring advanced features like the S Pen and Samsung DeX, it enhances productivity and creativity. Whether you're typing, sketching, or streaming, the Galaxy Book 2 Pro 360 provides a seamless computing experience tailored to your needs.",
    "price": 1099,
    "image": "/static/img/computer/laptop/samsung-galaxy-book-2-pro-360.jpg",
    "CPU": "Intel Evo platform",
    "RAM": "8GB",
    "storage_capacity": "256GB",
    "battery_power_time": "Up to 17 hours",
    "connectivity": "USB-C",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 22,
    "name": "Netgear Orbi Wi-Fi 6 Mesh System",
    "type": "Computer Network",
    "description": "The Netgear Orbi Wi-Fi 6 Mesh System is your solution for fast, reliable Wi-Fi coverage across your home. With its advanced technology, it eliminates dead zones, ensuring seamless connectivity for all your devices, from streaming to gaming and beyond.",
    "price": 349,
    "image": "/static/img/computer/network/netgear-orbi-wi-fi-6-mesh-system.jpg",
    "brand": "Netgear",
    "sales": 0
  },
  {
    "id": 23,
    "name": "DJI Osmo Mobile 6 Gimbal",
    "type": "Smartphone Accessories",
    "description": "The DJI Osmo Mobile 6 Gimbal is a must-have accessory for smartphone videographers. With its advanced stabilization technology, it ensures smooth and professional-looking footage, even in motion. Compact and easy to use, it enhances your smartphone videography experience, allowing you to capture steady shots with ease. Whether you're filming vlogs, travel videos, or family moments, the Osmo Mobile 6 Gimbal elevates your smartphone videography to the next level.",
    "price": 199,
    "image": "/static/img/phone/accessories/dji-osmo-mobile-6-gimbal.jpg",
    "connectivity": "Bluetooth",
    "brand": "DJI",
    "sales": 0
  },
  {
    "id": 24,
    "name": "GoPro MAX",
    "type": "Camera",
    "description": "The GoPro MAX is a versatile camera designed for capturing immersive 360-degree footage and traditional wide-angle shots. With its innovative features like Max HyperSmooth stabilization and six built-in microphones for immersive audio, it offers unparalleled versatility for content creators. Whether you're filming action-packed adventures or creative storytelling, the GoPro MAX delivers stunning visuals and immersive experiences that push the boundaries of traditional videography.",
    "price": 499,
    "image": "/static/img/camera/gopro-max.jpg",
    "battery_power_time": "Up to 2 hours (5.7K/30fps)",
    "connectivity": "USB-C",
    "brand": "GoPro",
    "sales": 0
  },
  {
    "id": 25,
    "name": "Bose QuietComfort 45 Headphones",
    "type": "Audio",
    "description": "The Bose QuietComfort 45 Headphones offer premium audio quality and exceptional noise-canceling capabilities, providing a serene listening experience in any environment. With their comfortable design and long-lasting battery life, they're perfect for extended use during travel, work, or relaxation. Whether you're enjoying music, podcasts, or movies, the QuietComfort 45 headphones deliver immersive sound and peace of mind, allowing you to focus on what matters most.",
    "price": 329,
    "image": "/static/img/audio/bose-quietcomfort-45-headphones.jpg",
    "battery_power_time": "Up to 24 hours (wireless)",
    "connectivity": "Bluetooth",
    "brand": "Bose",
    "sales": 0
  },
  {
    "id": 26,
    "name": "Lenovo ThinkPad X1 Carbon",
    "type": "Computer Laptop",
    "description": "The Lenovo ThinkPad X1 Carbon is a top-of-the-line laptop renowned for its sleek design, durability, and powerful performance. With its lightweight carbon fiber construction and long battery life, it's perfect for professionals on the go. Featuring a vibrant display, robust security features, and lightning-fast processing, the ThinkPad X1 Carbon delivers a seamless computing experience for productivity, creativity, and beyond.",
    "price": 1499,
    "image": "/static/img/computer/laptop/lenovo-thinkpad-x1-carbon.jpg",
    "CPU": "Intel Evo platform",
    "RAM": "16GB",
    "storage_capacity": "512GB",
    "battery_power_time": "Up to 19 hours",
    "connectivity": "USB-C, Thunderbolt",
    "operating_system": "Windows 11",
    "brand": "Lenovo",
    "sales": 0
  },
  {
    "id": 27,
    "name": "Samsung Galaxy Watch 5 Pro",
    "type": "Smartwatch",
    "description": "The Samsung Galaxy Watch 5 Pro is a premium smartwatch designed to elevate your daily life. With advanced health and fitness tracking features, it helps you stay on top of your wellness goals. Its sleek design, vibrant display, and long-lasting battery make it a stylish and reliable companion for your active lifestyle. Plus, with convenient connectivity options and intuitive controls, the Galaxy Watch 5 Pro keeps you connected and in control throughout your day.",
    "price": 429,
    "image": "/static/img/smartwatch/samsung-galaxy-watch-5-pro.jpg",
    "battery_power_time": "Up to 8 days (typical use)",
    "gps": "yes",
    "connectivity": "Bluetooth",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 28,
    "name": "Apple Watch SE (2nd Gen)",
    "type": "Smartwatch",
    "description": "The Apple Watch SE (2nd Gen) combines essential features with affordability, making it an accessible entry into the world of smartwatches. With its sleek design, vibrant display, and powerful performance, it offers a seamless experience for tracking fitness, receiving notifications, and staying connected. Whether you're monitoring your workouts or managing your schedule, the Apple Watch SE (2nd Gen) delivers the core functionality you need to stay productive and motivated throughout the day.",
    "price": 279,
    "image": "/static/img/smartwatch/apple-watch-se.jpg",
    "cellular": "optional",
    "battery_power_time": "Up to 18 hours (all-day wear)",
    "connectivity": "Bluetooth",
    "brand": "Apple",
    "sales": 0
  },
  {
    "id": 29,
    "name": "Fujifilm Instax Mini 11",
    "type": "Camera",
    "description": "The Fujifilm Instax Mini 11 is a stylish and user-friendly instant camera that brings fun and spontaneity to photography. With its compact design and automatic exposure settings, it's perfect for capturing and printing memories on the go. Whether you're at a party, on vacation, or just hanging out with friends, the Instax Mini 11 lets you instantly turn moments into tangible keepsakes, adding a nostalgic touch to your photography experience.",
    "price": 79,
    "image": "/static/img/camera/fujifilm-instax-mini-11.jpg",
    "film_format": "Fujifilm Instax Mini film",
    "brand": "Fujifilm",
    "sales": 0
  },
  {
    "id": 30,
    "name": "Samsung Galaxy Buds Pro 2",
    "type": "Audio",
    "description": "The Samsung Galaxy Buds Pro 2 are cutting-edge wireless earbuds designed to deliver premium sound quality and immersive listening experiences. With active noise cancellation and a comfortable, ergonomic design, they provide an uninterrupted audio experience in any environment. Whether you're listening to music, taking calls, or accessing voice assistants, the Galaxy Buds Pro 2 offer crystal-clear sound and intuitive controls, making them the perfect companion for your on-the-go lifestyle.",
    "price": 229,
    "image": "/static/img/audio/samsung-galaxy-buds-pro-2.jpg",
    "battery_power_time": "Up to 8 hours (ANC on)",
    "connectivity": "Bluetooth",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 31,
    "name": "Xbox Series S",
    "type": "Gaming",
    "description": "The Xbox Series S is a compact yet powerful gaming console that delivers high-performance gaming at an affordable price. With its sleek design and next-generation hardware, it offers smooth gameplay, fast load times, and stunning visuals in a digital-only package. Whether you're playing the latest AAA titles or enjoying your favorite Xbox Game Pass games, the Series S provides an immersive gaming experience for players of all levels.",
    "price": 299,
    "image": "/static/img/gaming/xbox-series-s.jpg",
    "storage_capacity": "512GB",
    "connectivity": "HDMI, USB",
    "brand": "Microsoft",
    "sales": 0
  },
  {
    "id": 32,
    "name": "Anker 577 PowerCore 23000 Portable Charger",
    "type": "Smartphone Chargers",
    "description": "The Anker 577 PowerCore 23000 Portable Charger is a reliable and high-capacity power bank designed to keep your devices charged on the go. With its massive 23,000mAh battery capacity, it can charge smartphones, tablets, and other devices multiple times before needing a recharge itself. Compact and portable, it's perfect for travel, outdoor adventures, or everyday use when you need reliable backup power.",
    "price": 59,
    "image": "/static/img/phone/chargers/anker-577-powercore-23000-portable-charger.jpg",
    "battery_power": "23000mAh",
    "brand": "Anker",
    "sales": 0
  },
  {
    "id": 33,
    "name": "Sony WF-1000XM4 Wireless Earbuds",
    "type": "Audio",
    "description": "The Sony WF-1000XM4 Wireless Earbuds are premium earbuds offering industry-leading noise cancellation and exceptional sound quality. With their sleek design and comfortable fit, they provide immersive audio experiences whether you're listening to music, making calls, or enjoying podcasts. Featuring advanced technology and long battery life, they're perfect for on-the-go use, keeping you entertained and connected throughout your day.",
    "price": 279,
    "image": "/static/img/audio/sony-wf-1000xm4-wireless-earbuds.jpg",
    "battery_power_time": "Up to 8 hours (ANC on)",
    "connectivity": "Bluetooth",
    "brand": "Sony",
    "sales": 0
  },
  {
    "id": 34,
    "name": "Blue Yeti Nano Microphone",
    "type": "Audio",
    "description": "The Blue Yeti Nano Microphone is a compact yet powerful USB microphone designed for professional-quality audio recording. With its sleek design and plug-and-play functionality, it's perfect for podcasting, streaming, voiceovers, and more. Featuring Blue's renowned sound quality and versatile pickup patterns, the Yeti Nano delivers crisp and clear audio, making it an essential tool for content creators, musicians, and voice artists alike.",
    "price": 99,
    "image": "/static/img/audio/blue-yeti-nano-microphone.jpg",
    "connectivity": "USB",
    "brand": "Logitech",
    "sales": 0
  },
  {
    "id": 35,
    "name": "Samsung Galaxy Tab S7 FE",
    "type": "Computer Tablet",
    "description": "The Samsung Galaxy Tab S7 FE is a versatile computer tablet that combines productivity and entertainment features in a sleek package. With its large display, powerful processor, and S Pen compatibility, it's perfect for multitasking, note-taking, and creative tasks. Whether you're working on documents, streaming content, or enjoying digital art, the Galaxy Tab S7 FE offers a premium tablet experience tailored to your needs.",
    "price": 529,
    "image": "/static/img/computer/tablet/samsung-galaxy-tab-s7-fe.jpg",
    "CPU": "Snapdragon 750G",
    "RAM": "4GB",
    "storage_capacity": "128GB",
    "battery_power_time": "Up to 13 hours (video playback)",
    "resolution": "12.4\" (2560 x 1600)",
    "connectivity": "USB-C",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 36,
    "name": "Belkin BOOSTCHARGE Pro USB-C Power Delivery Wall Charger",
    "type": "Smartphone Chargers",
    "description": "The Belkin BOOSTCHARGE Pro USB-C Power Delivery Wall Charger is a fast charger for smartphones. It uses USB-C Power Delivery to provide up to 25W of power for Samsung devices and 20W for iPhones. It is compact and portable, making it easy to take with you wherever you go.",
    "price": 39,
    "image": "/static/img/phone/chargers/belkin-boostcharge-pro-usb-c-power-delivery-wall-charger.jpg",
    "wattage": "typically 30W or higher",
    "connectivity": "USB-C",
    "brand": "Belkin",
    "sales": 0
  },
  {
    "id": 37,
    "name": "AMD Ryzen 5 5600X CPU",
    "type": "Computer Components",
    "description": "The AMD Ryzen 5 5600X is a high-performance CPU designed for gaming and productivity. With 6 cores and 12 threads, it offers exceptional multi-threaded performance and energy efficiency. Featuring a base clock of 3.7 GHz and a max boost clock of 4.6 GHz, this processor is built on AMD's advanced Zen 3 architecture, delivering superior speed and responsiveness for demanding applications and multitasking.",
    "price": 299,
    "image": "/static/img/computer/components/amd-ryzen-5-5600x-CPU.jpg",
    "cores": 6,
    "socket_cpu": "AM4",
    "brand": "AMD",
    "sales": 0
  },
  {
    "id": 38,
    "name": "NVIDIA GeForce RTX 3060 Ti Graphics Card",
    "type": "Computer Components",
    "description": "The NVIDIA GeForce RTX 3060 Ti is a powerful graphics card designed for gamers and creators. Equipped with 8GB of GDDR6 memory, it delivers stunning visuals and high frame rates. Built on the NVIDIA Ampere architecture, it features 4864 CUDA cores, ray tracing, and DLSS technology for enhanced graphics and AI performance. Ideal for 1080p and 1440p gaming, the RTX 3060 Ti offers an excellent balance of performance and value.",
    "price": 499,
    "image": "/static/img/computer/components/nvidia-geforce-rtx-3060-ti-graphics-card.jpg",
    "RAM": "8GB",
    "brand": "NVIDIA",
    "sales": 0
  },
  {
    "id": 39,
    "name": "Samsung 980 Pro 1TB NVMe PCIe Gen4 Solid State Drive",
    "type": "Computer Components",
    "description": "The Samsung 980 Pro 1TB NVMe PCIe Gen4 SSD is a powerhouse storage solution, delivering exceptional speed and reliability for demanding computing needs. With cutting-edge PCIe Gen4 technology, it offers lightning-fast read and write speeds, ensuring swift data access and transfer. Boasting a spacious 1TB capacity, it provides ample room for storing your games, applications, and multimedia files.",
    "price": 149,
    "image": "/static/img/computer/components/samsung-980-pro-nvme-pcie-gen4-ssd.jpg",
    "storage_capacity": "1TB",
    "interface": "NVMe PCIe Gen4",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 40,
    "name": "ASUS ROG Strix B550-F Gaming WiFi Motherboard",
    "type": "Computer Components",
    "description": "The ASUS ROG Strix B550-F Gaming WiFi motherboard is a premium choice for gamers and PC enthusiasts. Featuring support for AMD Ryzen processors, PCIe 4.0, and dual M.2 slots, it offers excellent performance and expandability. Equipped with built-in WiFi, robust power delivery, and customizable RGB lighting, it combines style with functionality to meet the demands of modern gaming rigs.",
    "price": 229,
    "image": "/static/img/computer/components/asus-rog-strix-b550-f-gaming-wifi-motherboard.jpg",
    "socket_cpu": "AM4",
    "form_factor": "ATX",
    "wifi": "yes",
    "brand": "ASUS",
    "sales": 0
  },
  {
    "id": 41,
    "name": "Corsair Vengeance RGB Pro 16GB (2x8GB) DDR4 3200MHz RAM",
    "type": "Computer Components",
    "description": "The Corsair Vengeance RGB Pro 16GB (2x8GB) DDR4 3200MHz RAM kit is designed to enhance your gaming and multitasking experience. With a stylish design and customizable RGB lighting, it adds flair to your build. Operating at a high frequency of 3200MHz, it offers fast and reliable performance for smooth gameplay and seamless multitasking. With a total capacity of 16GB spread across two modules, it provides ample memory for demanding applications and games.",
    "price": 89,
    "image": "/static/img/computer/components/corsair-vengeance-rgb-pro-ddr4-ram.jpg",
    "capacity": "16GB",
    "speed": "3200MHz",
    "brand": "Corsair",
    "sales": 0
  },
  {
    "id": 42,
    "name": "MSI Alpha 15 Advantage Edition Gaming Laptop",
    "type": "Computer Laptop",
    "description": "The MSI Alpha 15 Advantage Edition Gaming Laptop combines power and portability for an exceptional gaming experience on the go. Equipped with AMD Ryzen processors and Radeon RX graphics, it delivers high-performance gaming performance. Featuring a sleek design and vibrant display, it offers immersive visuals and smooth gameplay. With advanced cooling technology and long-lasting battery life, it ensures reliable performance during intense gaming sessions.",
    "price": 1299,
    "image": "/static/img/computer/laptop/msi-alpha-15-advantage-edition-gaming-laptop.jpg",
    "CPU": "AMD Ryzen",
    "graphics_card": "NVIDIA RTX",
    "display": "high refresh rate",
    "brand": "MSI",
    "sales": 0
  },
  {
    "id": 43,
    "name": "TP-Link Archer AX55 Wi-Fi 6 Router",
    "type": "Computer Network",
    "description": "The TP-Link Archer AX55 Wi-Fi 6 Router is a cutting-edge networking solution designed to provide blazing-fast wireless speeds and reliable connectivity for your home or office. With support for the latest Wi-Fi 6 technology, it offers significant improvements in speed, capacity, and performance, making it perfect for streaming, gaming, and connecting multiple devices simultaneously.",
    "price": 99,
    "image": "/static/img/computer/network/tp-link-archer-ax55-wi-fi-6-router.jpg",
    "wifi": "Wi-Fi 6",
    "brand": "TP-Link",
    "sales": 0
  },
  {
    "id": 44,
    "name": "Gigabyte Aorus GC PH-GVN20D GeForce GTX 1650 Low Profile Graphics Card",
    "type": "Computer Components",
    "description": "The Gigabyte Aorus GC PH-GVN20D GeForce GTX 1650 Low Profile Graphics Card is a compact yet powerful solution for gaming and multimedia tasks. With its low-profile design, it fits into smaller PC cases while still delivering excellent performance. Equipped with NVIDIA's GeForce GTX 1650 GPU, it offers smooth gameplay and accelerated performance for a wide range of games and applications.",
    "price": 279,
    "image": "/static/img/computer/components/gigabyte-aorus-gc-ph-gvn20d-geforce-gtx-1650-low-profile-graphics-card.jpg",
    "form_factor": "low profile",
    "RAM": "4GB",
    "brand": "Gigabyte",
    "sales": 0
  },
  {
    "id": 45,
    "name": "Noctua NH-D15 CPU Cooler",
    "type": "Computer Components",
    "description": "The Noctua NH-D15 CPU Cooler is a top-of-the-line air cooler renowned for its exceptional performance and quiet operation. Featuring a dual-tower design with six heat pipes and two premium-grade fans, it provides superior cooling efficiency, allowing for stable CPU temperatures even under heavy loads. The NH-D15's renowned build quality and ease of installation make it a favorite among PC enthusiasts and overclockers.",
    "price": 139,
    "image": "/static/img/computer/components/noctua-nh-d15-cpu-cooler.jpg",
    "brand": "Noctua",
    "sales": 0
  },
  {
    "id": 46,
    "name": "Seagate Barracuda 2TB 3.5\" Internal Hard Drive",
    "type": "Computer Components",
    "description": "The Seagate Barracuda 2TB 3.5\" Internal Hard Drive offers ample storage space and reliable performance for your computing needs. With a capacity of 2TB, it provides plenty of room to store your files, games, and multimedia content. Built with Seagate's renowned reliability, it ensures data integrity and longevity, making it suitable for both everyday use and demanding applications.",
    "price": 59,
    "image": "/static/img/computer/components/seagate-barracuda-hdd.jpg",
    "storage_capacity": "2TB",
    "interface": "3.5\" SATA",
    "brand": "Seagate",
    "sales": 0
  },
  {
    "id": 47,
    "name": "ASUS TUF Gaming VG27AQ1A Gaming Monitor",
    "type": "Computer Peripherals",
    "description": "The ASUS TUF Gaming VG27AQ1A Gaming Monitor is a high-performance display designed to enhance your gaming experience. With a 27-inch IPS panel and a resolution of 2560x1440, it delivers crisp visuals and vibrant colors, while also providing wide viewing angles for immersive gameplay. Featuring a fast 165Hz refresh rate and 1ms response time, it ensures smooth and fluid motion, reducing blur and ghosting in fast-paced games.",
    "price": 279,
    "image": "/static/img/computer/peripherals/asus-tuf-gaming-vg27aq1a-gaming-monitor.jpg",
    "size": "27 inches",
    "refresh_rate": "likely high refresh rate (check specifications)",
    "response_time": "likely fast response time (check specifications)",
    "brand": "ASUS",
    "sales": 0
  },
  {
    "id": 48,
    "name": "Microsoft Surface Laptop Studio",
    "type": "Computer Laptop",
    "description": "The Microsoft Surface Laptop Studio is a versatile and powerful laptop designed for creators and professionals. Combining the flexibility of a laptop with the creativity of a studio, it features a unique design that allows you to switch between laptop, stage, and studio modes effortlessly. Equipped with the latest Intel processors and NVIDIA graphics, it offers exceptional performance for demanding tasks such as photo and video editing, 3D modeling, and gaming.",
    "price": 1599,
    "image": "/static/img/computer/laptop/microsoft-surface-laptop-studio.jpg",
    "touchscreen": "yes",
    "brand": "Microsoft",
    "sales": 0
  },
  {
    "id": 49,
    "name": "Western Digital WD Black SN770 NVMe PCIe Gen4 SSD 2TB",
    "type": "Computer Components",
    "description": "The Western Digital WD Black SN770 NVMe PCIe Gen4 SSD 2TB is a high-performance storage solution engineered for gamers, content creators, and professionals seeking top-tier speed and reliability. With a spacious 2TB capacity, it provides ample storage space for games, applications, and large multimedia files. Leveraging PCIe Gen4 technology, it delivers blazing-fast read and write speeds, ensuring quick data access and transfer for seamless multitasking and gaming experiences.",
    "price": 179,
    "image": "/static/img/computer/components/western-digital-wd-black-sn770-ssd.jpg",
    "storage_capacity": "2TB",
    "interface": "NVMe PCIe Gen4",
    "brand": "Western Digital",
    "sales": 0
  },
  {
    "id": 50,
    "name": "Thermaltake H500 ATX Mid Tower Case",
    "type": "Computer Components",
    "description": "The Thermaltake H500 ATX Mid Tower Case offers a blend of style, performance, and versatility for your PC build. With its spacious interior and optimized airflow design, it provides excellent cooling capabilities to keep your components running efficiently. Featuring a sleek and modern aesthetic, it includes tempered glass panels to showcase your build and customizable RGB lighting for added flair.",
    "price": 129,
    "image": "/static/img/computer/components/thermaltake-h500-case.jpg",
    "form_factor": "ATX mid-tower",
    "materials": "steel and tempered glass",
    "brand": "Thermaltake",
    "sales": 0
  },
  {
    "id": 51,
    "name": "SteelSeries Apex Pro TKL Mechanical Keyboard",
    "type": "Computer Peripherals",
    "description": "The SteelSeries Apex Pro TKL Mechanical Keyboard is a premium gaming keyboard designed for professional gamers and enthusiasts. Featuring SteelSeries' innovative OmniPoint switches, it offers customizable actuation points to suit your gaming style and preferences. With per-key RGB lighting and sleek aluminum construction, it provides a stunning aesthetic to complement your gaming setup.",
    "price": 179,
    "image": "/static/img/computer/peripherals/steelseries-apex-pro-tkl-keyboard.jpg",
    "layout": "tenkeyless",
    "lighting": "per-key RGB",
    "switch_type": "adjustable actuation (check specifications)",
    "brand": "SteelSeries",
    "sales": 0
  },
  {
    "id": 52,
    "name": "EVGA Supernova GT 650W 80+ Gold Certified Power Supply Unit",
    "type": "Computer Components",
    "description": "The EVGA Supernova GT 650W 80+ Gold Certified Power Supply Unit is a high-quality and efficient power supply designed to meet the demands of modern gaming PCs and workstations. With its 80+ Gold certification, it offers high efficiency and low heat generation, resulting in quieter operation and reduced energy costs. Equipped with a 650W power output, it provides reliable and stable power delivery to your components, ensuring smooth and consistent performance even under heavy loads. ",
    "price": 89,
    "image": "/static/img/computer/components/evga-supernova-gt-psu.jpg",
    "wattage": "650W",
    "certification": "80+ Gold certified",
    "brand": "EVGA",
    "sales": 0
  },
  {
    "id": 53,
    "name": "Gigabyte B560M DS3H V2 Micro ATX Motherboard",
    "type": "Computer Components",
    "description": "The Gigabyte B560M DS3H V2 Micro ATX Motherboard is a compact yet powerful motherboard designed for mainstream users and gamers. Built on the Intel B560 chipset, it supports 10th and 11th generation Intel Core processors, offering excellent performance and versatility. With its Micro ATX form factor, it fits into smaller cases while still providing ample connectivity options and expansion slots.",
    "price": 119,
    "image": "/static/img/computer/components/gigabyte-b560m-ds3h-motherboard.jpg",
    "socket_cpu": "LGA1200",
    "form_factor": "micro ATX",
    "brand": "Gigabyte",
    "sales": 0
  },
  {
    "id": 54,
    "name": "Samsung Odyssey G5 Curved Gaming Monitor",
    "type": "Computer Peripherals",
    "description": "The Samsung Odyssey G5 Curved Gaming Monitor is a premium display designed to elevate your gaming experience. With its curved screen and WQHD resolution, it offers immersive visuals and sharp details, allowing you to see every detail in your games. Featuring a fast 144Hz refresh rate and 1ms response time, it ensures smooth and responsive gameplay with minimal motion blur and input lag.",
    "price": 389,
    "image": "/static/img/computer/peripherals/samsung-odyssey-g5-curved-monitor.jpg",
    "curve": "curved",
    "refresh_rate": "likely high refresh rate (check specifications)",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 55,
    "name": "Razer Viper Ultimate Wireless Gaming Mouse",
    "type": "Computer Peripherals",
    "description": "The Razer Viper Ultimate Wireless Gaming Mouse is a top-of-the-line gaming peripheral designed to deliver exceptional performance and precision. With its advanced Razer Focus+ optical sensor, it offers unparalleled accuracy and responsiveness, making it perfect for competitive gaming. Featuring Razer's HyperSpeed wireless technology, it provides lag-free wireless connectivity for uninterrupted gameplay.",
    "price": 159,
    "image": "/static/img/computer/peripherals/razer-viper-ultimate-mouse.jpg",
    "connectivity": "wireless",
    "lighting": "customizable RGB",
    "brand": "Razer",
    "sales": 0
  },
  {
    "id": 56,
    "name": "Audio-Technica AT2020 Cardioid Condenser Microphone",
    "type": "Audio",
    "description": "The Audio-Technica AT2020 Cardioid Condenser Microphone is a professional-grade microphone suitable for studio recording, podcasting, streaming, and more. With its cardioid polar pattern, it effectively captures sound from the front while minimizing background noise, resulting in clear and focused audio recordings. Featuring a wide frequency response and high SPL handling, it delivers exceptional audio quality for vocals and instruments.",
    "price": 129,
    "image": "/static/img/audio/audio-technica-at2020-microphone.jpg",
    "brand": "Audio-Technica",
    "sales": 0
  },
  {
    "id": 57,
    "name": "WD Blue SN570 NVMe PCIe Gen3 SSD 1TB",
    "type": "Computer Components",
    "description": "The WD Blue SN570 NVMe PCIe Gen3 SSD 1TB offers high-speed storage performance for your computing needs. With its NVMe interface and PCIe Gen3 technology, it provides fast data transfer speeds, making it ideal for loading applications, transferring files, and multitasking. Its 1TB capacity offers ample space for storing your games, programs, and media files. Built with WD Blue's reliability and durability, it ensures long-term performance and data integrity.",
    "price": 79,
    "image": "/static/img/computer/components/wd-blue-sn570-ssd.jpg",
    "storage_capacity": "1TB",
    "interface": "NVMe PCIe Gen3",
    "brand": "Western Digital",
    "sales": 0
  },
  {
    "id": 58,
    "name": "NZXT Kraken X53 RGB AIO Liquid CPU Cooler",
    "type": "Computer Components",
    "description": "The NZXT Kraken X53 RGB AIO Liquid CPU Cooler is an advanced cooling solution designed to keep your CPU running at optimal temperatures. Featuring a 240mm radiator and two Aer RGB 2 fans, it provides efficient heat dissipation while adding a touch of customizable RGB lighting to your system. With its high-performance pump and durable tubing, it ensures reliable and quiet operation, even under heavy workloads.",
    "price": 229,
    "image": "/static/img/computer/components/nzxt-kraken-x53-rgb-aio-cooler.jpg",
    "socket_compatibility": "check manufacturer website",
    "lighting": "RGB",
    "brand": "NZXT",
    "sales": 0
  },
  {
    "id": 59,
    "name": "Be quiet! Pure Rock 2 Black CPU Cooler",
    "type": "Computer Components",
    "description": "The Be quiet! Pure Rock 2 Black CPU Cooler is a high-performance air cooler designed to provide efficient cooling for your CPU while maintaining low noise levels. Featuring a sleek black design with aluminum fins and a brushed aluminum top cover, it adds a stylish touch to your build. Equipped with four high-performance heat pipes and a Pure Wings 2 120mm PWM fan, it offers excellent heat dissipation and airflow for optimal cooling performance.",
    "price": 49,
    "image": "/static/img/computer/components/be-quiet-pure-rock-2-black-cpu-cooler.jpg",
    "noise_level": "low",
    "brand": "Be quiet!",
    "sales": 0
  },
  {
    "id": 60,
    "name": "ASUS ROG Strix Scope TKL Wireless Mechanical Keyboard",
    "type": "Computer Peripherals",
    "description": "Experience the tactile satisfaction of Cherry MX switches combined with the convenience of wireless connectivity. Enjoy the freedom of a tenkeyless layout, ideal for gamers who need extra desk space. Customize your gaming setup with vibrant RGB lighting options and take command of your media with dedicated controls, all tailored for multitasking gamers seeking both performance and style.",
    "price": 189,
    "image": "/static/img/computer/peripherals/asus-rog-strix-scope-tkl-wireless-keyboard.jpg",
    "layout": "tenkeyless",
    "connectivity": "wireless",
    "lighting": "customizable RGB",
    "switch_type": "Cherry MX",
    "brand": "ASUS",
    "sales": 0
  },
  {
    "id": 61,
    "name": "Logitech G PRO X Superlight Wireless Gaming Mouse",
    "type": "Computer Peripherals",
    "description": "Elevate your gaming prowess with the Logitech G PRO X Superlight, an ultra-lightweight wireless gaming mouse designed for competitive play. Harness the power of a high-performance sensor for pixel-perfect accuracy and precision. Its customizable design ensures a perfect fit for your hand, while the long-lasting battery life keeps you in the game for extended sessions without interruption.",
    "price": 149,
    "image": "/static/img/computer/peripherals/logitech-g-pro-x-superlight-mouse.jpg",
    "connectivity": "wireless",
    "brand": "Logitech",
    "sales": 0
  },
  {
    "id": 62,
    "name": "Seagate Backup Plus Slim Portable Hard Drive 1TB",
    "type": "Computer Peripherals",
    "description": "Safeguard your digital world with the Seagate Backup Plus Slim Portable Hard Drive, offering ample storage capacity in a compact and portable design. Store your data, photos, videos, and files on the move, and enjoy the convenience of USB connectivity for seamless access to your files across devices. Whether you're backing up important documents or storing cherished memories, this reliable hard drive ensures peace of mind wherever you go.",
    "price": 79,
    "image": "/static/img/computer/peripherals/seagate-backup-plus-slim-portable-drive.jpg",
    "storage_capacity": "1TB",
    "interface": "USB",
    "portability": "yes",
    "brand": "Seagate",
    "sales": 0
  },
  {
    "id": 63,
    "name": "Samsung Galaxy Z Fold 4",
    "type": "Smartphone Device",
    "description": "Immerse yourself in the future of mobile technology with the Samsung Galaxy Z Fold 4, a revolutionary foldable smartphone redefining the boundaries of multitasking and productivity. Unfold a large main display that seamlessly transitions between work and play, powered by a cutting-edge CPU for unparalleled performance. Experience the pinnacle of smartphone innovation with an innovative design that adapts to your needs, offering endless possibilities in the palm of your hand.",
    "price": 1799,
    "image": "/static/img/phone/device/samsung-galaxy-z-fold-4.jpg",
    "form_factor": "foldable",
    "display": "large main display",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 64,
    "name": "Sony a6400 Mirrorless Camera",
    "type": "Camera",
    "description": "Unlock your creativity with the Sony a6400, a compact and versatile mirrorless camera perfect for photography enthusiasts of all levels. Capture stunning images with confidence using its large APS-C sensor and enjoy the flexibility of interchangeable lenses with the Sony E-mount system. Whether you're capturing everyday moments or embarking on a photographic adventure, the a6400 delivers exceptional image quality and performance in a portable package.",
    "price": 899,
    "image": "/static/img/camera/sony-a6400-mirrorless-camera.jpg",
    "sensor_size": "APS-C",
    "lens_mount": "Sony E-mount",
    "brand": "Sony",
    "sales": 0
  },
  {
    "id": 65,
    "name": "DJI Osmo Mobile SE",
    "type": "Smartphone Accessories",
    "description": "Transform your smartphone videos into cinematic masterpieces with the DJI Osmo Mobile SE, a portable smartphone gimbal designed for vlogging and content creation on the go. Stabilize your video footage with precision and ease, ensuring smooth and professional-looking results every time. Compatible with a wide range of smartphones, the Osmo Mobile SE empowers creators to unleash their creativity and capture life's moments with unparalleled stability and style.",
    "price": 109,
    "image": "/static/img/phone/accessories/dji-osmo-mobile-se.jpg",
    "function": "stabilizes video footage",
    "compatibility": "smartphones",
    "brand": "DJI",
    "sales": 0
  },
  {
    "id": 66,
    "name": "AOC 24G2 Monitor",
    "type": "Computer Peripherals",
    "description": "Immerse yourself in the world of gaming with the AOC 24G2 Monitor, a budget-friendly display that doesn't compromise on performance. Boasting a high refresh rate and fast response time, this 24-inch gaming monitor delivers smooth and fluid gameplay, perfect for competitive gamers and casual enthusiasts alike. Its sleek design and compact size make it a versatile addition to any gaming setup, while its affordable price point ensures exceptional value for money.",
    "price": 209,
    "image": "/static/img/computer/peripherals/aoc-24g2-monitor.jpg",
    "size": "24 inches",
    "refresh_rate": "likely high refresh rate (check specifications)",
    "brand": "AOC",
    "sales": 0
  },
  {
    "id": 67,
    "name": "ASUS Strix Soar Sound Card",
    "type": "Computer Components",
    "description": "Elevate your audio experience with the ASUS Strix Soar Sound Card, designed to deliver immersive sound quality for headphones, speakers, and gaming headsets. Featuring a PCIe interface for seamless integration into your desktop setup, this sound card ensures crystal-clear audio reproduction with minimal interference. Whether you're gaming, listening to music, or watching movies, the Strix Soar enhances your audio experience with unparalleled clarity and depth.",
    "price": 119,
    "image": "/static/img/computer/components/asus-strix-soar.jpg",
    "interface": "PCIe",
    "brand": "ASUS",
    "sales": 0
  },
  {
    "id": 68,
    "name": "Thermaltake Toughpower Grand RGB 750W 80+ Gold Certified Power Supply Unit",
    "type": "Computer Components",
    "description": "Power your gaming rig with confidence using the Thermaltake Toughpower Grand RGB 750W PSU, a high-wattage and efficient power supply unit designed for gamers and enthusiasts. With 80+ Gold certification for superior efficiency and customizable RGB lighting for a touch of style, this PSU delivers reliable and stable power to your components while adding visual flair to your build. ",
    "price": 99,
    "image": "/static/img/computer/components/thermaltake-toughpower-grand-rgb-psu.jpg",
    "wattage": "750W",
    "certification": "80+ Gold certified",
    "lighting": "RGB",
    "brand": "Thermaltake",
    "sales": 0
  },
  {
    "id": 69,
    "type": "Computer Peripherals",
    "name": "Logitech G920 Driving Force Racing Wheel",
    "description": "Immerse yourself in the thrill of racing simulations with the Logitech G920 Driving Force Racing Wheel, the ultimate accessory for virtual drivers. Featuring force feedback technology and responsive pedals, this racing wheel delivers a realistic driving experience that brings your favorite racing games to life. Compatible with PC and gaming consoles, the G920 lets you feel every turn, bump, and drift as you navigate the track with precision and control.",
    "price": 359,
    "image": "/static/img/computer/peripherals/logitech-g920-racing-wheel.jpg",
    "compatibility": "PC or gaming consoles",
    "brand": "Logitech",
    "sales": 0
  },
  {
    "id": 70,
    "name": "MSI B460M Mortar Micro ATX Motherboard",
    "type": "Computer Components",
    "description": "Build your dream PC with the MSI B460M Mortar Micro ATX Motherboard, a versatile and reliable foundation for your budget-oriented desktop setup. With support for Intel CPUs and essential features like PCIe slots and M.2 connectors, this Micro ATX motherboard offers the perfect balance of performance and affordability. Its compact form factor makes it ideal for smaller PC builds, while its robust construction ensures long-term reliability for all your computing needs.",
    "price": 139,
    "image": "/static/img/computer/components/msi-b460m-mortar-motherboard.jpg",
    "socket_cpu": "LGA1200",
    "form_factor": "micro ATX",
    "brand": "MSI",
    "sales": 0
  },
  {
    "id": 71,
    "name": "Phanteks Enthoo Pro ATX Full Tower Case",
    "type": "Computer Components",
    "description": "Create the ultimate PC build with the Phanteks Enthoo Pro ATX Full Tower Case, a spacious and versatile chassis designed for enthusiasts and modders. Featuring tempered glass panels, excellent airflow, and ample room for cable management, this ATX full tower case offers everything you need to build a high-performance gaming rig or workstation. Whether you're showcasing your hardware or maximizing cooling efficiency, the Enthoo Pro provides the perfect canvas for your next PC masterpiece.",
    "price": 149,
    "image": "/static/img/computer/components/phanteks-enthoo-pro-case.jpg",
    "form_factor": "ATX full tower",
    "materials": "likely steel and tempered glass (check specifications)",
    "airflow": "excellent",
    "brand": "Phanteks",
    "sales": 0
  },
  {
    "id": 72,
    "name": "ADATA XPG Gammix D10 DDR4 RAM 16GB",
    "type": "Computer Components",
    "description": "Elevate your desktop's performance with the ADATA XPG Gammix D10 DDR4 RAM 16GB kit. Boasting high-performance capabilities and vibrant RGB lighting, this RAM offers various capacity and speed options to suit different needs and budgets, ensuring smooth multitasking and seamless gaming experiences.",
    "price": 78,
    "image": "/static/img/computer/components/adata-xpg-gammix-d10-ram-16gb.jpg",
    "capacity": "16GB",
    "lighting": "RGB",
    "brand": "ADATA",
    "sales": 0
  },
  {
    "id": 73,
    "name": "NETGEAR AC2000 Router",
    "type": "Computer Network",
    "description": "Upgrade your home or small office network with the NETGEAR AC2000 Router. This dual-band Wi-Fi router delivers reliable wireless connectivity and good performance, providing seamless internet access for multiple devices. Whether you're streaming, gaming, or browsing, this router ensures a smooth and stable connection.",
    "price": 139,
    "image": "/static/img/computer/network/netgear-ac2000-router.jpg",
    "wifi": "dual-band Wi-Fi",
    "brand": "NETGEAR",
    "sales": 0
  },
  {
    "id": 74,
    "name": "Intel Core i5-12400 CPU",
    "type": "Computer Components",
    "description": "Unleash powerful performance with the Intel Core i5-12400 CPU. Featuring six cores and excellent multitasking capabilities, this mid-range CPU delivers impressive performance for gaming, productivity, and content creation tasks. With its reliability and efficiency, it's the perfect choice for desktop users seeking a balance of performance and value.",
    "price": 189,
    "image": "/static/img/computer/components/intel-core-i5-12400-CPU.jpg",
    "cores": "6 cores",
    "socket_cpu": "likely LGA1200 (check specifications)",
    "brand": "Intel",
    "sales": 0
  },
  {
    "id": 75,
    "name": "Samsung 870 QVO 1TB SATA III SSD",
    "type": "Computer Components",
    "description": "Experience fast and reliable storage with the Samsung 870 QVO 1TB SATA III SSD. Designed for desktops and laptops, this SSD offers a balance of affordability and performance, making it ideal for everyday tasks such as booting up your system, loading applications, and transferring files. With its spacious capacity and SATA III interface, it's a versatile storage solution for your digital needs.",
    "price": 109,
    "image": "/static/img/computer/components/samsung-870-qvo-ssd.jpg",
    "interface": "SATA III",
    "storage_capacity": "1TB",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 76,
    "name": "WD Blue HDD 6TB",
    "type": "Computer Components",
    "description": "Expand your storage capabilities with the WD Blue HDD 6TB. This large-capacity internal hard drive provides ample space for storing your digital library, including large files, games, and media collections. With its reliable performance and cost-effectiveness, it's an ideal choice for desktop users seeking to upgrade their storage capacity.",
    "price": 235,
    "image": "/static/img/computer/components/wd-blue-6tb-hdd.jpg",
    "storage_capacity": "6TB",
    "brand": "Western Digital",
    "sales": 0
  },
  {
    "id": 77,
    "name": "Sony WH-1000XM4 Wireless Noise-Cancelling Headphones",
    "type": "Audio",
    "description": "Immerse yourself in superior sound quality and unparalleled comfort with the Sony WH-1000XM4 Wireless Noise-Cancelling Headphones. Featuring industry-leading noise cancellation technology, these headphones deliver a distraction-free listening experience, while the ergonomic design ensures long-lasting comfort during extended use. Whether you're commuting, working, or relaxing, these headphones provide an immersive audio experience like no other.",
    "price": 299,
    "image": "/static/img/audio/sony-wh-1000xm4-wireless-headphones.jpg",
    "connectivity": "wireless",
    "noise_cancellation": "industry-leading",
    "brand": "Sony",
    "sales": 0
  },
  {
    "id": 78,
    "name": "AOC G2590PX Monitor",
    "type": "Computer Peripherals",
    "description": "Elevate your gaming setup with the AOC G2590PX Monitor. This curved gaming monitor features a high refresh rate and 1440p resolution for sharper visuals, while FreeSync compatibility ensures smooth gameplay without tearing or stuttering. With its immersive curved design and gaming-centric features, it's the perfect choice for gamers seeking an edge in performance and immersion.",
    "price": 259,
    "image": "/static/img/computer/peripherals/aoc-g2590px-monitor.jpg",
    "curve": "curved",
    "refresh_rate": "likely high refresh rate (check specifications)",
    "resolution": "1440p",
    "sync_technology": "FreeSync compatible",
    "brand": "AOC",
    "sales": 0
  },
  {
    "id": 79,
    "name": "Be quiet! Pure Base 500 FX ATX Case",
    "type": "Computer Components",
    "description": "Build your dream PC with the Be quiet! Pure Base 500 FX ATX Case. Designed with airflow and aesthetics in mind, this mid-tower RGB ATX case features sound-dampening materials for quiet operation and a tempered glass side panel for showcasing your components in style. With its spacious interior and excellent cable management options, it provides the perfect foundation for a powerful and visually stunning PC build.",
    "price": 179,
    "image": "/static/img/computer/components/be-quiet-pure-base-500-fx-case.jpg",
    "form_factor": "mid-tower ATX",
    "lighting": "RGB",
    "side_panel": "tempered glass",
    "noise_level": "quiet",
    "brand": "Be quiet!",
    "sales": 0
  },
  {
    "id": 80,
    "name": "Gigabyte Aorus Gen4 NVMe PCIe M.2 SSD",
    "type": "Computer Components",
    "description": "Turbocharge your storage with the Gigabyte Aorus Gen4 NVMe PCIe M.2 SSD. Featuring high-performance PCIe Gen4 technology, this M.2 SSD offers ultra-fast boot times and application loading, making it ideal for desktops with compatible slots. With its spacious 1TB capacity and blazing-fast speeds, it's the perfect storage solution for enthusiasts seeking uncompromising performance and reliability.",
    "price": 299,
    "image": "/static/img/computer/components/gigabyte-aorus-gen4-nvme-ssd.jpg",
    "interface": "NVMe PCIe Gen4",
    "form_factor": "M.2",
    "storage_capacity": "1TB",
    "brand": "Gigabyte",
    "sales": 0
  },
  {
    "id": 81,
    "name": "MSI Clutch GM41 Lightweight Wireless Mouse",
    "type": "Computer Peripherals",
    "description": "Enhance your gaming experience with the MSI Clutch GM41 Lightweight Wireless Mouse. Designed for comfort during long gaming sessions, this mouse features an ergonomic design and customizable RGB lighting. With its wireless connectivity and high-performance sensor, it delivers precise and responsive control for gaming enthusiasts.",
    "price": 79,
    "image": "/static/img/computer/peripherals/msi-clutch-gm41-mouse.jpg",
    "weight": "lightweight",
    "connectivity": "wireless",
    "lighting": "customizable RGB",
    "brand": "MSI",
    "sales": 0
  },
  {
    "id": 82,
    "name": "XPG SX8200 Pro NVMe PCIe Gen3 SSD",
    "type": "Computer Components",
    "description": "Boost your system's performance with the XPG SX8200 Pro NVMe PCIe Gen3 SSD. Offering a good balance of performance and affordability, this SSD provides fast data transfer speeds and ample storage capacity for everyday use and moderate gaming, making it an excellent choice for desktops and laptops.",
    "price": 129,
    "image": "/static/img/computer/components/xpg-sx8200-pro-ssd.jpg",
    "interface": "NVMe PCIe Gen3",
    "storage_capacity": "1TB",
    "brand": "XPG",
    "sales": 0
  },
  {
    "id": 83,
    "name": "CORSAIR iCUE H100i Elite AIO Liquid CPU Cooler",
    "type": "Computer Components",
    "description": "Keep your CPU cool and stylish with the CORSAIR iCUE H100i Elite AIO Liquid CPU Cooler. Featuring RGB lighting effects and a powerful radiator, this all-in-one liquid cooler delivers efficient cooling performance for desktops with compatible cases, ensuring optimal thermal management and visual flair.",
    "price": 199,
    "image": "/static/img/computer/components/corsair-icue-h100i-elite-cooler.jpg",
    "lighting": "RGB",
    "brand": "CORSAIR",
    "sales": 0
  },
  {
    "id": 84,
    "name": "SteelSeries Arctis 7 Wireless Gaming Headset",
    "type": "Audio",
    "description": "Immerse yourself in gaming audio with the SteelSeries Arctis 7 Wireless Gaming Headset. With its comfortable design, clear audio quality, and built-in microphone, this wireless headset provides an immersive gaming communication experience, allowing you to stay connected and focused during intense gaming sessions.",
    "price": 209,
    "image": "/static/img/audio/steelseries-arctis-7-headset.jpg",
    "connectivity": "wireless",
    "microphone": "built-in",
    "brand": "SteelSeries",
    "sales": 0
  },
  {
    "id": 85,
    "name": "EVGA GeForce GTX 1650 SC Ultra Graphics Card",
    "type": "Computer Components",
    "description": "Elevate your gaming experience with the EVGA GeForce GTX 1650 SC Ultra Graphics Card. Offering a significant performance boost over integrated graphics, this ultra graphics card is ideal for casual gaming and multimedia tasks, delivering smooth visuals and responsive gameplay for a more enjoyable gaming experience.",
    "price": 289,
    "image": "/static/img/computer/components/evga-geforce-gtx-1650-sc-ultra.jpg",
    "performance_focus": "casual gaming and multimedia",
    "brand": "EVGA",
    "sales": 0
  },
  {
    "id": 86,
    "name": "Google Pixel 7 Pro",
    "type": "Smartphone Device",
    "description": "Experience premium smartphone performance with the Google Pixel 7 Pro. Featuring a powerful CPU, advanced camera system with excellent low-light performance, and sleek design, this high-end smartphone offers unparalleled performance and style, making it the perfect choice for tech-savvy users.",
    "price": 899,
    "image": "/static/img/phone/device/google-pixel-7-pro.jpg",
    "grade": "high-end",
    "CPU": "powerful",
    "camera": "advanced with excellent low-light performance",
    "brand": "Google",
    "sales": 0
  },
  {
    "id": 87,
    "name": "Samsung Galaxy Z Flip 4",
    "type": "Smartphone Device",
    "description": "Embrace innovation with the Samsung Galaxy Z Flip 4. This foldable smartphone features a compact design that unfolds to reveal a larger screen, offering the perfect balance of multitasking and portability. With its sleek form factor and advanced features, it's the ultimate smartphone for modern lifestyles.",
    "price": 999,
    "image": "/static/img/phone/device/samsung-galaxy-z-flip-4.jpg",
    "form_factor": "foldable",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 88,
    "name": "Insta360 GO 2",
    "type": "Camera",
    "description": "Capture immersive videos with the Insta360 GO 2. This ultra-compact and lightweight action camera offers 360-degree recording capabilities, making it perfect for vlogging, action sports, and creative projects. With its versatile features and portable design, it's the ideal companion for capturing life's adventures in stunning detail.",
    "price": 349,
    "image": "/static/img/camera/insta360-go-2.jpg",
    "form_factor": "ultra-compact and lightweight",
    "video_recording": "360 degrees",
    "brand": "Insta360",
    "sales": 0
  },
  {
    "id": 89,
    "name": "ASUS ROG Zephyrus G14 Gaming Laptop",
    "type": "Computer Laptop",
    "description": "Dominate the gaming arena with the ASUS ROG Zephyrus G14 Gaming Laptop. Featuring a powerful graphics card, fast refresh rate display, and portable design, this gaming laptop delivers smooth and immersive gameplay wherever you go. With its high-performance components and sleek aesthetics, it's the ultimate gaming powerhouse for gamers on the move.",
    "price": 2399,
    "image": "/static/img/computer/laptop/asus-rog-zephyrus-g14-gaming-laptop.jpg",
    "performance_focus": "gaming",
    "graphics_card": "high-performance",
    "display": "fast refresh rate",
    "portability": "portable design",
    "brand": "ASUS",
    "sales": 0
  },
  {
    "id": 90,
    "name": "Acer Chromebook Spin 713",
    "type": "Computer Laptop",
    "description": "The Acer Chromebook Spin 713 is an affordable Chromebook with a convertible design, long battery life, and access to cloud-based applications. Perfect for everyday tasks and students on a budget, it offers versatility and convenience without compromising on performance.",
    "price": 849,
    "image": "/static/img/computer/laptop/acer-chromebook-spin-713.jpg",
    "operating_system": "Chrome OS",
    "form_factor": "convertible",
    "battery_power_time": "long",
    "brand": "Acer",
    "sales": 0
  },
  {
    "id": 91,
    "name": "iPhone SE (2022)",
    "type": "Smartphone Device",
    "description": "The iPhone SE (2022) is a budget-friendly iPhone featuring the latest A15 Bionic chip for powerful performance and iOS features at a more accessible price point. Ideal for users who want the reliability and capabilities of iOS without breaking the bank.",
    "price": 499,
    "image": "/static/img/phone/device/iphone-se-2022.jpg",
    "brand": "Apple",
    "CPU": "A15 Bionic chip",
    "operating_system": "iOS",
    "grade": "budget-friendly",
    "sales": 0
  },
  {
    "id": 92,
    "name": "Canon EOS R7 Mirrorless Camera",
    "type": "Camera",
    "description": "The Canon EOS R7 is an APS-C mirrorless camera with excellent image quality, a fast autofocus system, and a compact design. Perfect for enthusiasts and aspiring photographers, it offers versatility and performance in a portable package.",
    "price": 1599,
    "image": "/static/img/camera/canon-eos-r7-mirrorless-camera.jpg",
    "sensor_size": "APS-C",
    "brand": "Canon",
    "sales": 0
  },
  {
    "id": 93,
    "name": "Lenovo ThinkPad X1 Carbon Gen 10",
    "type": "Computer Laptop",
    "description": "The Lenovo ThinkPad X1 Carbon Gen 10 is a thin and light business laptop with a durable design, long battery life, and excellent keyboard. Designed for productivity tasks and professionals on the go, it offers reliability and performance in a portable form factor.",
    "price": 1899,
    "image": "/static/img/computer/laptop/lenovo-thinkpad-x1-carbon-gen-10.jpg",
    "weight": "thin and light",
    "durability": "durable",
    "battery_power_time": "long",
    "keyboard": "excellent",
    "business_oriented": "yes (based on ThinkPad branding)",
    "brand": "Lenovo",
    "sales": 0
  },
  {
    "id": 94,
    "name": "Ubiquiti UniFi Security Gateway",
    "type": "Computer Network",
    "description": "The Ubiquiti UniFi Security Gateway is a security appliance for homes and small businesses, offering firewall protection, intrusion detection, and advanced network management features. Ensure the security of your network with this reliable and versatile solution.",
    "price": 149,
    "image": "/static/img/computer/network/ubiquiti-unifi-security-gateway.jpg",
    "function": "security appliance",
    "security_features": "firewall protection, intrusion detection",
    "brand": "Ubiquiti",
    "sales": 0
  },
  {
    "id": 95,
    "name": "Sony RX100 VII Compact Camera",
    "type": "Camera",
    "description": "The Sony RX100 VII is a high-zoom compact camera with a large sensor, excellent image quality, and fast autofocus. Perfect for travel and everyday photography, it offers versatility and performance in a pocket-friendly size.",
    "price": 799,
    "image": "/static/img/camera/sony-rx100-vii-camera.jpg",
    "zoom": "high",
    "sensor_size": "large",
    "form_factor": "compact",
    "brand": "Sony",
    "sales": 0
  },
  {
    "id": 96,
    "name": "Google Pixel Buds Pro",
    "type": "Audio",
    "description": "The Google Pixel Buds Pro are wireless earbuds with active noise cancellation, a comfortable design, and integration with Google Assistant. Enjoy convenient voice control and music listening on your smartphone with these stylish and functional earbuds.",
    "price": 199,
    "image": "/static/img/audio/google-pixel-buds-pro.jpg",
    "connectivity": "wireless",
    "noise_cancellation": "active",
    "smart_assistant": "Google Assistant",
    "brand": "Google",
    "sales": 0
  },
  {
    "id": 97,
    "name": "TP-Link Deco Mesh Wi-Fi System",
    "type": "Computer Network",
    "description": "The TP-Link Deco Mesh Wi-Fi System is a whole-home mesh Wi-Fi system for eliminating dead zones and providing seamless wireless network coverage. Enjoy reliable and fast Wi-Fi throughout your house with this easy-to-use and affordable solution.",
    "price": 389,
    "image" : "/static/img/computer/network/tp-link-deco-mesh-wi-fi-system.jpg",
    "coverage": "whole-home",
    "technology": "mesh Wi-Fi",
    "brand": "TP-Link",
    "sales": 0
  },
  {
    "id": 98,
    "name": "Insta360 One X2",
    "type": "Camera",
    "description": "The Insta360 One X2 is a 360-degree action camera with 5.7K capture resolution, flow state stabilization, and a variety of creative shooting modes. Capture immersive video experiences with smooth footage and stunning detail.",
    "price": 309,
    "image": "/static/img/camera/insta360-one-x2.jpg",
    "video_recording": "360 degrees",
    "resolution": "5.7K",
    "stabilization": "flow state",
    "brand": "Insta360",
    "sales": 0
  },
  {
    "id": 99,
    "name": "Synology DiskStation DS220+ NAS",
    "type": "Computer Network",
    "description": "The Synology DiskStation DS220+ is a network-attached storage (NAS) device for storing and sharing files across your home network. With backup solutions and media streaming capabilities, it offers convenience and peace of mind for managing your digital content.",
    "price": 369,
    "image": "/static/img/computer/network/synology-diskstation-ds220+.jpg",
    "function": "network-attached storage (NAS)",
    "storage_capacity": "check specifications (supports multiple disks)",
    "brand": "Synology",
    "sales": 0
  },
  {
    "id": 100,
    "name": "Netgear Nighthawk Pro Gaming XR500 Router",
    "type": "Computer Network",
    "description": " A high-performance router designed for gamers, offering prioritization of gaming traffic, advanced Quality of Service (QoS) features, and low latency for smooth online gaming experiences. With its gaming-oriented features, it ensures a competitive edge for serious gamers.",
    "price": 349,
    "image": "/static/img/computer/network/netgear-nighthawk-pro-gaming-xr500-router.jpg",
    "gaming_oriented": "yes (from description)",
    "features": "prioritization of gaming traffic, advanced QoS, low latency",
    "brand": "Netgear",
    "sales": 0
  },
  {
    "id": 101,
    "name": "Nikon Z fc Mirrorless Camera",
    "type": "Camera",
    "description": "The Nikon Z fc is a retro-styled mirrorless camera with a large APS-C sensor, excellent image quality, and compatibility with Nikon Z-mount lenses. Ideal for enthusiasts and photographers who value aesthetics, it combines classic design with modern technology.",
    "price": 1499,
    "image": "/static/img/camera/nikon-z-fc-mirrorless-camera.jpg",
    "sensor_size": "APS-C",
    "style": "retro-styled",
    "lens_mount": "Nikon Z-mount",
    "brand": "Nikon",
    "sales": 0
  },
  {
    "id": 102,
    "name": "Apple AirPods (3rd generation)",
    "type": "Audio",
    "description": "The Apple AirPods (3rd generation) are wireless earbuds with an improved design, spatial audio for immersive listening experiences, and longer battery life compared to previous generations. Enjoy seamless connectivity and superior sound quality with these stylish and functional earbuds.",
    "price": 189,
    "image": "/static/img/audio/apple-airpods-3rd-generation.jpg",
    "connectivity": "wireless",
    "features": "improved design, spatial audio",
    "battery_power_time": "longer (compared to previous generations)",
    "brand": "Apple",
    "sales": 0
  },
  {
    "id": 103,
    "name": "Eero Pro 6E Mesh Wi-Fi System",
    "type": "Computer Network",
    "description": "The Eero Pro 6E is a mesh Wi-Fi system supporting the latest Wi-Fi 6E standard, offering faster speeds, wider coverage, and reduced network congestion. Perfect for demanding users and smart home setups, it ensures reliable and fast Wi-Fi connectivity throughout your home.",
    "price": 399,
    "image": "/static/img/computer/network/eero-pro-6e-mesh-wi-fi.jpg",
    "technology": "mesh Wi-Fi",
    "wi-fi_standard": "Wi-Fi 6E",
    "benefits": "faster speeds, wider coverage, reduced network congestion",
    "brand": "Eero",
    "sales": 0
  },
  {
    "id": 104,
    "name": "Fujifilm X-T4 Mirrorless Camera",
    "type": "Camera",
    "description": "The Fujifilm X-T4 is an APS-C mirrorless camera with a high-resolution sensor, fast autofocus system, weather-sealed body, and excellent image quality. Designed for enthusiasts and professionals, it delivers exceptional performance in a compact and rugged package.",
    "price": 1699,
    "image": "/static/img/camera/fujifilm-x-t4-mirrorless-camera.jpg",
    "sensor_size": "APS-C",
    "sensor_resolution": "high-resolution",
    "autofocus": "fast",
    "weatherproof": "weather-sealed body",
    "target_audience": "enthusiasts and professionals",
    "brand": "Fujifilm",
    "sales": 0
  },
  {
    "id": 105,
    "name": "Google Pixel 6a",
    "type": "Smartphone Device",
    "description": "The Google Pixel 6a is a mid-range smartphone featuring Google's Tensor chip, excellent camera performance, and a clean Android experience at an attractive price point. Enjoy advanced features and reliable performance without breaking the bank.",
    "price": 299,
    "image": "/static/img/phone/device/google-pixel-6a.jpg",
    "grade": "mid-range",
    "CPU": "Google Tensor chip",
    "operating_system": "Android",
    "camera": "excellent",
    "brand": "Google",
    "sales": 0
  },
  {
    "id": 106,
    "name": "Raspberry Pi 4 Model B",
    "type": "Computer Mini-PC/SBC",
    "description": "The Raspberry Pi 4 Model B is a popular and versatile single-board computer with a quad-core CPU. Ideal for learning programming, building DIY projects, and running media playback systems, it offers endless possibilities for creative projects and educational purposes.",
    "price": 85,
    "image": "/static/img/computer/mini-pc_sbc/raspberry-pi-4-model-b.jpg",
    "CPU": "quad-core",
    "uses": "learning programming, building DIY projects, running media playback systems",
    "brand": "Raspberry Pi",
    "sales": 0
  },
  {
    "id": 107,
    "name": "Intel NUC 12 Pro Mini PC",
    "type": "Computer Mini-PC/SBC",
    "description": "The Intel NUC 12 Pro is a compact and powerful Mini PC with a 12th Gen Intel CPU, offering desktop-like performance for productivity tasks, home entertainment, and light gaming. With its small form factor, it is perfect for space-constrained environments without compromising on performance.",
    "price": 429,
    "image": "/static/img/computer/mini-pc_sbc/intel-nuc-12-pro-mini-pc.jpg",
    "cpu_generation": "12th Gen Intel",
    "performance_focus": "desktop-like",
    "uses": "productivity tasks, home entertainment, light gaming",
    "form_factor": "small",
    "brand": "Intel",
    "sales": 0
  },
  {
    "id": 108,
    "name": "ASUS ROG Strix XG27UQ Moni   tor",
    "type": "Computer Peripherals",
    "description": "The ASUS ROG Strix XG27UQ is a high-performance gaming monitor with a fast refresh rate, 1440p resolution, and G-SYNC compatibility. Designed for gaming, it delivers smooth and tear-free visuals, ensuring an immersive and responsive gaming experience.",
    "price": 499,
    "image": "/static/img/computer/peripherals/asus-rog-strix-xg27uq-monitor.jpg",
    "performance_focus": "gaming",
    "refresh_rate": "fast",
    "resolution": "1440p",
    "g_sync_compatible": "yes (from description)",
    "brand": "ASUS",
    "sales": 0
  },
  {
    "id": 109,
    "name": "Odyssey G9 by Samsung",
    "type": "Computer Peripherals",
    "description": "The Odyssey G9 by Samsung is a super ultrawide curved monitor with a massive screen size, high resolution, and high refresh rate. Ideal for gaming, design work, and multitasking, it offers an immersive viewing experience with its curved display and advanced features.",
    "price": 1399,
    "image": "/static/img/computer/peripherals/odyssey-g9-by-samsung.jpg",
    "aspect_ratio": "super ultrawide",
    "curve": "curved",
    "size": "massive",
    "resolution": "high",
    "refresh_rate": "high",
    "uses": "gaming, design work, multitasking",
    "brand": "Samsung",
    "sales": 0
  },
  {
    "id": 110,
    "name": "Orange Pi 5 Single-Board Computer",
    "type": "Computer Mini-PC/SBC",
    "description": "A cost-effective single-board computer featuring a Rockchip RK3566 CPU, suitable for basic computing tasks, educational purposes, and hobbyist projects. With its affordability and versatility, it provides a platform for learning and experimentation.",
    "price": 55,
    "image": "/static/img/computer/mini-pc_sbc/orange-pi-5-sbc.jpg",
    "CPU": "Rockchip RK3566",
    "grade": "cost-effective",
    "uses": "basic computing tasks, educational purposes, hobbyist projects",
    "brand": "Orange Pi",
    "sales": 0
  },
  {
    "id": 111,
    "name": "Geekworm Onion Omega 2",
    "type": "Computer Mini-PC/SBC",
    "description": "An ultra-compact and low-power single-board computer with Wi-Fi connectivity, ideal for basic development tasks, creating smart home devices, and Internet of Things (IoT) applications. Its small form factor and low power consumption make it suitable for various embedded projects.",
    "price": 15,
    "image": "/static/img/computer/mini-pc_sbc/geekworm-onion-omega-2.jpg",
    "form_factor": "ultra-compact",
    "power_consumption": "low-power",
    "connectivity": "Wi-Fi",
    "uses": "basic development tasks, creating smart home devices, Internet of Things (IoT) applications",
    "brand": "Geekworm",
    "sales": 0
  },
  {
    "id": 112,
    "name": "LG 27GN800-B Monitor",
    "type": "Computer Peripherals",
    "description": "A 27-inch WQHD (2560x1440) monitor with a high refresh rate and IPS panel technology, suitable for creative professionals and gamers. With excellent color accuracy and viewing angles, it offers a vibrant visual experience for both work and play.",
    "price": 319,
    "image": "/static/img/computer/peripherals/lg-27gn800-b-monitor.jpg",
    "size": "27-inch",
    "resolution": "WQHD (2560x1440)",
    "refresh_rate": "high",
    "panel_type": "IPS",
    "target_audience": "creative professionals and gamers",
    "brand": "LG",
    "sales": 0
  },
  {
    "id": 113,
    "name": "Rock Pi 4 Model B Plus",
    "type": "Computer Mini-PC/SBC",
    "description": "A single-board computer with a powerful RK3399 CPU, offering improved performance over Raspberry Pi for running media servers, emulation, and light desktop applications. With its enhanced capabilities, it provides a versatile platform for various computing tasks.",
    "price": 169,
    "image": "/static/img/computer/mini-pc_sbc/rock-pi-4-model-b-plus.jpg",
    "CPU": "RK3399",
    "performance_focus": "improved over Raspberry Pi",
    "uses": "running media servers, emulation, light desktop applications",
    "brand": "Rock Pi",
    "sales": 0
  },
  {
    "id": 114,
    "name": "Apple Mac Mini (M2)",
    "type": "Computer Mini-PC/SBC",
    "description": "A compact and powerful Mac desktop computer featuring Apple's M2 chip, offering excellent performance for demanding tasks like video editing, music production, and professional workflows. With its small footprint, it provides desktop-class performance in a compact package.",
    "price": 899,
    "image": "/static/img/computer/mini-pc_sbc/apple-mac-mini-m2.jpg",
    "CPU": "Apple M2 chip",
    "performance_focus": "excellent",
    "uses": "video editing, music production, professional workflows",
    "form_factor": "compact",
    "brand": "Apple",
    "sales": 0
  },
  {
    "id": 115,
    "name": "MSI Modern AM271 2K Monitor",
    "type": "Computer Peripherals",
    "description": "A stylish and thin-bezel monitor with a 27-inch QHD (2560x1440) resolution, built-in speakers, and a variety of connectivity options for work and entertainment. Its sleek design and high-resolution display make it suitable for both productivity and multimedia use.",
    "price": 279,
    "image": "/static/img/computer/peripherals/msi-modern-am271-2k-monitor.jpg",
    "size": "27-inch",
    "resolution": "QHD (2560x1440)",
    "features": "thin-bezel, built-in speakers",
    "uses": "work and entertainment",
    "brand": "MSI",
    "sales": 0
  },
  {
    "id": 116,
    "name": "Sceptre Curved Gaming Monitor",
    "type": "Computer Peripherals",
    "description": "A curved gaming monitor offering a variety of panel sizes, resolutions, and refresh rates to choose from, providing an immersive viewing experience for gamers at different budgets. With its curved display and gaming-focused features, it enhances the gaming experience.",
    "price": 319,
    "image": "/static/img/computer/peripherals/sceptre-curved-gaming-monitor.jpg",
    "curve": "curved",
    "performance_focus": "gaming",
    "options": "various panel sizes, resolutions, and refresh rates",
    "brand": "Sceptre",
    "sales": 0
  },
  {
    "id": 117,
    "name": "Khadas Vim3L",
    "type": "Computer Mini-PC/SBC",
    "description": "A compact and low-power single-board computer with Android or Linux operating system options, suitable for media playback, retro gaming, and DIY projects with a focus on portability. Its versatility and portability make it ideal for various embedded and DIY applications.",
    "price": 45,
    "image": "/static/img/computer/mini-pc_sbc/khadas-vim3l.jpg",
    "form_factor": "compact",
    "power_consumption": "low-power",
    "operating_system": "Android or Linux",
    "uses": "media playback, retro gaming, DIY projects",
    "brand": "Khadas",
    "sales": 0
  }
]
